Autodesk.Revit.DB.IFC.IFCExtrusionData.AddLoop(Autodesk.Revit.DB.CurveLoop)
Adds a curve loop to the extrusion data.
pLoop:
The curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionData.ExtrusionDirection
The direction used for the extrusion.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012